Catalogs/ВыставленныеСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ВыставленныеСчета</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>БанковскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ВыставленныеСчетаКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ВыставленныеСчетаКонтрагентов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>БанковскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ТоварыВРезервеНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыВРезервеНаСкладах</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументРезерва</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйОрдерНаТовары</v8:Type>
						<v8:Type>cfg:DocumentRef.ВнутреннийЗаказ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СрокИзготовления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Catalogs/ВыставленныеСчета/Ext/ManagerModule.bsl
Процедура ОбновитьВсеСчетаИДокиРезерва() Экспорт
	
	// Полная очистка регистра: записи по контрагентам, у которых резервов уже нет,
	// иначе остались бы висеть и съедать лимиты банковских счетов.
	НаборЗаписей = РегистрыСведений.ВыставленныеСчетаКонтрагентов.СоздатьНаборЗаписей();
	НаборЗаписей.Записать();


	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТоварыВРезервеНаСкладахОстатки.ДокументРезерва.Контрагент КАК Контрагент,
	               |	СУММА(ВЫБОР
	               |			КОГДА ТоварыВРезервеНаСкладахОстатки.Склад.СтатусГотовности = ""Виготовленно""
	               |				ТОГДА ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК КоличествоОстаток
	               |ИЗ
	               |	РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(, ) КАК ТоварыВРезервеНаСкладахОстатки
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТоварыВРезервеНаСкладахОстатки.ДокументРезерва.Контрагент
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	КоличествоОстаток УБЫВ";
				   
	Контрагенты = Запрос.Выполнить().Выгрузить();
	Контрагенты.Свернуть("Контрагент");	
	
	Для Каждого Стр Из Контрагенты Цикл 
		//Биас.СформироватьФайлыPDFXMLРезервовВФоне(Стр.Контрагент); 
		
		СтруктураПараметров = Новый Структура;
	
		СтруктураПараметров.Вставить("Контрагент"        , Стр.Контрагент);
		СтруктураПараметров.Вставить("СуммаКорректировки", 0);
		
		//Биас.СформироватьФайлыPDFXMLРезервов(СтруктураПараметров) 
		Биас.СформироватьФайлыHTMLXMLРезервов(СтруктураПараметров);

	КонецЦикла;

	//Справочники.БанковскиеСчета.ПолучитьВыставленныйСчет(10000,)
КонецПроцедуры

// Разовая перегонка данных справочника в регистр ВыставленныеСчетаКонтрагентов.
//
// Запускается один раз после загрузки конфигурации, например из консоли:
//   Справочники.ВыставленныеСчета.ПеренестиДанныеВРегистр();
//
// Повторный запуск безопасен: регистр перезаписывается целиком. Дубли по одному
// контрагенту, накопившиеся в справочнике, сворачиваются в одну запись - берётся
// самая свежая по дате. Сам справочник не изменяется: он остаётся как архив.
//
Процедура ПеренестиДанныеВРегистр() Экспорт

	Запрос = Новый Запрос;

	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВыставленныеСчета.Контрагент КАК Контрагент,
	|	ВыставленныеСчета.БанковскийСчет КАК БанковскийСчет,
	|	ВыставленныеСчета.Сумма КАК Сумма,
	|	ВыставленныеСчета.Дата КАК Дата
	|ИЗ
	|	Справочник.ВыставленныеСчета КАК ВыставленныеСчета
	|ГДЕ
	|	НЕ ВыставленныеСчета.ПометкаУдаления
	|	И ВыставленныеСчета.Контрагент <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата";

	Выборка = Запрос.Выполнить().Выбрать();

	Перенесено = 0;

	Пока Выборка.Следующий() Цикл

		НаборЗаписей = РегистрыСведений.ВыставленныеСчетаКонтрагентов.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Контрагент.Установить(Выборка.Контрагент);

		Запись = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, Выборка);

		// Упорядочивание по дате плюс замещение набора по контрагенту оставляют
		// от дублей последнюю запись.
		НаборЗаписей.Записать();

		Перенесено = Перенесено + 1;

	КонецЦикла;

	Сообщить("Перенесено записей из справочника ВыставленныеСчета: " + Перенесено);

КонецПроцедуры
